# GetDoubleValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..GetDoubleValue Method
ScheduleFilter Class See Also
---
Gets the filter value for a filter using a double value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double GetDoubleValue()
```

Visual Basic
---
```text
Public Function GetDoubleValue As Double
```

Visual C++
---
```text
public:
double GetDoubleValue()
```

# ### Return Value
The filter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The filter value is not a double. |

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace